; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	spectrograph3 - mode
	spectrograph1 - mode
	image2 - mode
	thermograph0 - mode
	thermograph4 - mode
	Star0 - direction
	Star2 - direction
	Star3 - direction
	GroundStation5 - direction
	Star7 - direction
	Star6 - direction
	GroundStation1 - direction
	Star10 - direction
	GroundStation4 - direction
	Star9 - direction
	GroundStation8 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 thermograph4)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 Star6)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 spectrograph3)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 Star10)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
	(supports instrument3 thermograph0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star11)
	(calibration_target instrument3 GroundStation8)
	(calibration_target instrument3 Star9)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
)
(:goal (and
	(have_image Star12 image2)
	(have_image Phenomenon13 image2)
	(have_image Phenomenon14 image2)
	(have_image Planet15 thermograph4)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 4
2. (turn_to satellite0 groundstation1 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 4
3. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 0 of 4
4. (turn_to satellite0 phenomenon13 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon13)
   goals met: 0 of 4
5. (take_image satellite0 phenomenon13 instrument1 image2)
   added: (have_image phenomenon13 image2)
   goals met: 1 of 4
6. (turn_to satellite0 groundstation1 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 groundstation1)
   goals met: 1 of 4
7. (turn_to satellite0 phenomenon14 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon14)
   goals met: 1 of 4
8. (take_image satellite0 phenomenon14 instrument1 image2)
   added: (have_image phenomenon14 image2)
   goals met: 2 of 4
9. (turn_to satellite0 groundstation1 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 groundstation1)
   goals met: 2 of 4
10. (turn_to satellite0 star12 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star12)
   goals met: 2 of 4
11. (take_image satellite0 star12 instrument1 image2)
   added: (have_image star12 image2)
   goals met: 3 of 4
12. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 3 of 4
13. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 4
14. (turn_to satellite0 planet15 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 planet15)
   goals met: 3 of 4
15. (turn_to satellite0 star6 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star6)
   goals met: 3 of 4
16. (calibrate satellite0 instrument0 star6)
   added: (calibrated instrument0)
   goals met: 3 of 4
17. (turn_to satellite0 planet15 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet15)
   goals met: 3 of 4
18. (take_image satellite0 planet15 instrument0 thermograph4)
   added: (have_image planet15 thermograph4)
   goals met: 4 of 4
